Revit 2026 API

# WireSizeSetContains Method

---

Tests for the existence of a wire size within the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Contains(
	WireSize item
)
```
```vb
Public Overridable Function Contains (
	item As WireSize
) As Boolean
```
```cpp
public:
virtual bool Contains(
	WireSize^ item
)
```
```fsharp
abstract Contains :
        item : WireSize -> bool
override Contains :
        item : WireSize -> bool
```

#### Parameters

item WireSize
    The wire size to be searched for.

#### Return Value

BooleanThe Contains method returns True if the wire size is within the set, otherwise False.

#### Reference

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace